Revit 2027 API
ScheduleDefinition.IsValidCategoryForEmbeddedSchedule Method
 Indicates if a category can be used for an embedded ScheduleDefinition in this ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidCategoryForEmbeddedSchedule(
	ElementId categoryId
)
Public Function IsValidCategoryForEmbeddedSchedule (
	categoryId As ElementId
) As Boolean
public:
bool IsValidCategoryForEmbeddedSchedule(
	ElementId^ categoryId
)
member IsValidCategoryForEmbeddedSchedule :
        categoryId : ElementId -> bool
Parameters
categoryId ElementId
 The category ID to check.
Return Value
Boolean
 True if the category can be used for an embedded ScheduleDefinition, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace